ELPasEDT/src/Catalogs/МаркиОборудования/МаркиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МаркиОборудования</name>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокСокращенный</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаДляИзменения</name>
    <type>
      <types>CatalogRef.МаркиОборудования</types>
    </type>
  </attributes>
</mdclass:Catalog>

ELPasEDT/src/Enums/СтатусыЗаявокСокращенный/СтатусыЗаявокСокращенный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокСокращенный</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

ELPasEDT/src/Catalogs/МаркиОборудования/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ВИ++
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	//ВИ--
	
	//ВИ++
	//Заявки
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Статус = Перечисления.СтатусыЗаявокСокращенный.НаРассмотрении;
	КонецЕсли;
	//ВИ--
	
	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.МаркиОборудования) Тогда
		Элементы.ФормаИзменить.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.Статус.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаДляИзмененияПриИзменении(Элемент)
	
	ИзменениеСсылкиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСсылкиСервер()
	
	Объект.Наименование = Объект.СсылкаДляИзменения.Наименование;
	Объект.ВидОборудования = Объект.СсылкаДляИзменения.ВидОборудования;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаЗаявки.Видимость = ОтображатьГруппуЗаявок();
	Элементы.СсылкаДляИзменения.Видимость = ЗначениеЗаполнено(Объект.СсылкаДляИзменения) И ОтображатьГруппуЗаявок();
	Элементы.ФормаИзменить.Видимость = Не Объект.Ссылка.Пустая() И (Не ЗначениеЗаполнено(Объект.Статус) ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокСокращенный.Утверждена"));
	Элементы.СсылкаДляИзменения.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Функция ОтображатьГруппуЗаявок()
	
	Возврат Объект.Статус = Перечисления.СтатусыЗаявокСокращенный.НаРассмотрении;
	
КонецФункции

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Изменить(Команда)
	
	ЭтаФорма.Закрыть();
	
	Форма = ПолучитьФорму("Справочник.МаркиОборудования.Форма.ФормаЭлемента");
	ЗаполнитьЗначенияСвойств(Форма.Объект,Объект,,"Код"); 
	Форма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокСокращенный.НаРассмотрении");
	Форма.Объект.СсылкаДляИзменения = Объект.Ссылка;
	Форма.Открыть();	
	
КонецПроцедуры
